{
  "name": "cloud9",
  "description": "Installs/Configures cloud9",
  "long_description": "This directory contains the cookbooks used to configure systems in your infrastructure with Chef.\n\nKnife needs to be configured to know where the cookbooks are located with the `cookbook_path` setting. If this is not set, then several cookbook operations will fail to work properly.\n\n    cookbook_path [\"./cookbooks\"]\n\nThis setting tells knife to look for the cookbooks directory in the present working directory. This means the knife cookbook subcommands need to be run in the `chef-repo` directory itself. To make sure that the cookbooks can be found elsewhere inside the repository, use an absolute path. This is a Ruby file, so something like the following can be used:\n\n    current_dir = File.dirname(__FILE__)\n    cookbook_path [\"#{current_dir}/../cookbooks\"]\n\nWhich will set `current_dir` to the location of the knife.rb file itself (e.g. `~/chef-repo/.chef/knife.rb`).\n\nConfigure knife to use your preferred copyright holder, email contact and license. Add the following lines to `.chef/knife.rb`.\n\n    cookbook_copyright \"Example, Com.\"\n    cookbook_email     \"cookbooks@example.com\"\n    cookbook_license   \"apachev2\"\n\nSupported values for `cookbook_license` are \"apachev2\", \"mit\",\"gplv2\",\"gplv3\",  or \"none\". These settings are used to prefill comments in the default recipe, and the corresponding values in the metadata.rb. You are free to change the the comments in those files.\n\nCreate new cookbooks in this directory with Knife.\n\n    knife cookbook create COOKBOOK\n\nThis will create all the cookbook directory components. You don't need to use them all, and can delete the ones you don't need. It also creates a README file, metadata.rb and default recipe.\n\nYou can also download cookbooks directly from the Opscode Cookbook Site. There are two subcommands to help with this depending on what your preference is.\n\nThe first and recommended method is to use a vendor branch if you're using Git. This is automatically handled with Knife.\n\n    knife cookbook site install COOKBOOK\n\nThis will:\n\n* Download the cookbook tarball from cookbooks.opscode.com.\n* Ensure its on the git master branch.\n* Checks for an existing vendor branch, and creates if it doesn't.\n* Checks out the vendor branch (chef-vendor-COOKBOOK).\n* Removes the existing (old) version.\n* Untars the cookbook tarball it downloaded in the first step.\n* Adds the cookbook files to the git index and commits.\n* Creates a tag for the version downloaded.\n* Checks out the master branch again.\n* Merges the cookbook into master.\n* Repeats the above for all the cookbooks dependencies, downloading them from the community site\n\nThe last step will ensure that any local changes or modifications you have made to the cookbook are preserved, so you can keep your changes through upstream updates.\n\nIf you're not using Git, use the site download subcommand to download the tarball.\n\n    knife cookbook site download COOKBOOK\n\nThis creates the COOKBOOK.tar.gz from in the current directory (e.g., `~/chef-repo`). We recommend following a workflow similar to the above for your version control tool.\n",
  "maintainer": "Adrien Ferré",
  "maintainer_email": "ferre.adrien@gmail.com",
  "license": "Apache 2.0",
  "platforms": {
    "debian": ">= 0.0.0",
    "ubuntu": ">= 0.0.0"
  },
  "dependencies": {
    "nvm": ">= 0.0.0",
    "apt": ">= 0.0.0"
  },
  "recommendations": {
  },
  "suggestions": {
  },
  "conflicting": {
  },
  "providing": {
  },
  "replacing": {
  },
  "attributes": {
  },
  "groupings": {
  },
  "recipes": {
  },
  "version": "0.1.0"
}